In [1]:
import numpy as np
import pandas as pd

In [4]:
data = pd.read_csv('income.csv') 
data

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [6]:
data = pd.read_csv('income.csv', names=['name','income']) 
data

        name              income
0       Name  Monthly Income ($)
1        Rob                5000
2      Rafiq                6000
3       Nina                4000
4      Sofia                7500
5      Mohan                8000
6        Tao                7000
7  Elon Musk            10000000

In [8]:
data = pd.read_csv('income.csv', names=['name','income'], skiprows=[0]) 
data

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [10]:
data.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [13]:
data.income.quantile(0.25,interpolation='lower')

5000

In [14]:
data.income.quantile(1)

10000000.0

In [22]:
percentile_99 = data.income.quantile(0.99)
percentile_99

9400479.999999994

In [19]:
data[data.income>percentile_99]

        name    income
6  Elon Musk  10000000

In [23]:
data_no_outlier = data[data.income <= percentile_99]
data_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [41]:
data['income'][3] = np.NaN
data

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [42]:
data.income.mean()

1671666.6666666667

In [43]:
data_new = data.fillna(data.income.mean())
data_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [44]:
data_new = data.fillna(data.income.median())
data_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0